# **Valores duplicados**

In [1]:
import pandas as pd
import numpy as np

In [2]:
DF= pd.DataFrame({'col 1':[1,1,2,2,3,3,3],
                  'col 2': ['a','a','b','b','c','c','c'],
                  'col3 ': ['A','A','B','B','C','C','C']})
DF

   col 1 col 2 col3
0      1     a     A
1      1     a     A
2      2     b     B
3      2     b     B
4      3     c     C
5      3     c     C
6      3     c     C

In [3]:
DF.duplicated() #validar datos duplicados

0    False
1     True
2    False
3     True
4    False
5     True
6     True
dtype: bool

In [4]:
DF.drop_duplicates() #elimina los datos duplicados

   col 1 col 2 col3
0      1     a     A
2      2     b     B
4      3     c     C

In [5]:
DF= pd.DataFrame({'col 1':[1,1,2,2,3,3,3],
                  'col 2': ['a','a','b','b','c','c','c'],
                  'col 3': ['A','A','B','B','C','C','C']})
DF

   col 1 col 2 col 3
0      1     a     A
1      1     a     A
2      2     b     B
3      2     b     B
4      3     c     C
5      3     c     C
6      3     c     C

In [6]:
DF.drop_duplicates(['col 3']) #puedo eliminar la columna completa

   col 1 col 2 col 3
0      1     a     A
2      2     b     B
4      3     c     C

# **Crear serie multi-index**

In [7]:
import pandas as pd
import numpy as np

In [8]:
arrays = [np.array(["a", "a", "a", "b", "b", "b", "c", "c","c"]), #indices
          np.array([1,2,3, 1,2,3, 1,2,3]),]

s = pd.Series(np.random.randn(9), index=arrays) #numeros random
s

a  1    0.687487
   2   -1.304901
   3   -0.659222
b  1    1.194986
   2    0.757538
   3    1.549293
c  1    0.208716
   2    1.423213
   3    0.383530
dtype: float64

In [9]:
s.sum() #sumo

4.240639526984239

In [10]:
s.index #veo estructura de series

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 2),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('c', 3)],
           )

In [11]:
s.drop(index="a") #eliminando el indice a, se elimina todo el nivel

b  1    1.194986
   2    0.757538
   3    1.549293
c  1    0.208716
   2    1.423213
   3    0.383530
dtype: float64

In [12]:
s.drop(index=3,level=1) #dropeo de niveles, indice 3 del nivel 1 (arranca en 0)

a  1    0.687487
   2   -1.304901
b  1    1.194986
   2    0.757538
c  1    0.208716
   2    1.423213
dtype: float64

In [13]:
# Primero nivel
s['a']

1    0.687487
2   -1.304901
3   -0.659222
dtype: float64

In [14]:
# Segundo nivel
s.loc[:,2] #todos los elementos del indice 2

a   -1.304901
b    0.757538
c    1.423213
dtype: float64

In [15]:
s.unstack() #transformacion a matriz

          1         2         3
a  0.687487 -1.304901 -0.659222
b  1.194986  0.757538  1.549293
c  0.208716  1.423213  0.383530

In [16]:
s.unstack(level=0) #a la inversa, si quiero cambiar de posicion

          a         b         c
1  0.687487  1.194986  0.208716
2 -1.304901  0.757538  1.423213
3 -0.659222  1.549293  0.383530

# **Group by**

In [19]:
df = pd.DataFrame({'data1' : np.random.randn(5),
                   'data2' : np.random.randn(5),
                   'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one']})
df

      data1     data2 key1 key2
0  1.330970  0.746157    a  one
1  0.658366 -1.113047    a  two
2  1.082461  0.838258    b  one
3  0.666495 -1.802106    b  two
4 -0.851185  0.803536    a  one

In [20]:
grouped =df['data1'].groupby(df['key1']) #es como que defino niveles

In [21]:
grouped

In [22]:
grouped.median()

key1
a    0.658366
b    0.874478
Name: data1, dtype: float64

In [23]:
df['data1'].groupby(df['key1']).sum() #los datos agrupame por key1 y suma

key1
a    1.138151
b    1.748956
Name: data1, dtype: float64

In [24]:
df['data1'].groupby([df['key1'],df['key2']]).sum()

key1  key2
a     one     0.479785
      two     0.658366
b     one     1.082461
      two     0.666495
Name: data1, dtype: float64

# **Apply**

In [25]:
df = pd.DataFrame({'A' : [1,2,3,4],
'B' : [5,6,7,8],
'C' : [9,10,11,12],
'D' : [13,14,15,16]})
df

   A  B   C   D
0  1  5   9  13
1  2  6  10  14
2  3  7  11  15
3  4  8  12  16

In [26]:
df1= df.copy() #hago una copia del dataset, siempre es mejor que hacer d1 = df porque sino piso la informacion
df1

   A  B   C   D
0  1  5   9  13
1  2  6  10  14
2  3  7  11  15
3  4  8  12  16

In [27]:
df1.apply(np.sqrt)

          A         B         C         D
0  1.000000  2.236068  3.000000  3.605551
1  1.414214  2.449490  3.162278  3.741657
2  1.732051  2.645751  3.316625  3.872983
3  2.000000  2.828427  3.464102  4.000000

In [28]:
# Creo mi funcion
def cubo_david(y):
  return y**3

df['A'].apply(cubo_david)

0     1
1     8
2    27
3    64
Name: A, dtype: int64

# **Pivot**

In [45]:
df = pd.DataFrame(data={'A' : ['John', 'Boby', 'Mina'],
'B' : ['Masters', 'Graduate', 'Graduate'],
'C' : [27,23,21]})
df

      A         B   C
0  John   Masters  27
1  Boby  Graduate  23
2  Mina  Graduate  21

In [46]:
df.pivot(index='A',columns='B')

            C
B    Graduate Masters
A
Boby     23.0     NaN
John      NaN    27.0
Mina     21.0     NaN

In [47]:
df.pivot(index='B',columns='C')

             A
C           21    23    27
B
Graduate  Mina  Boby   NaN
Masters    NaN   NaN  John

In [35]:
#df.pivot('A','C')

In [34]:
#df.pivot('A','B','C')

In [48]:
df.pivot(index='A',columns='B',values=['C'])

            C
B    Graduate Masters
A
Boby     23.0     NaN
John      NaN    27.0
Mina     21.0     NaN

In [49]:
# Porque hay error aca --> John esta repetido, si lo modifico con vale desaparece el error
df1 = pd.DataFrame({'A' : ['John', 'Vale', 'Mina'], #no puedo definir indices duplicados
'B' : ['Masters', 'Masters', 'Graduate'],
'C' : [27,23,21]})

df1.pivot(index='A',columns='B',values=['C'])

            C
B    Graduate Masters
A
John      NaN    27.0
Mina     21.0     NaN
Vale      NaN    23.0

# **.Astype**

In [50]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
'key2' : ['one', 'two', 'one', 'two', 'one'],
'data1' : np.random.randn(5),
'data2' : np.random.randn(5)})

df

  key1 key2     data1     data2
0    a  one  0.385607 -0.479862
1    a  two  1.409952 -0.655872
2    b  one  0.780312  0.021284
3    b  two  1.412470 -2.530579
4    a  one -0.899479  0.094479

In [51]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [52]:
df['data1'] = df['data1'].astype(str)
df.dtypes

key1      object
key2      object
data1     object
data2    float64
dtype: object

# **Value_counts**

In [53]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
'key2' : ['one', 'two', 'one', 'two', 'one'],
'data1' : np.random.randn(5),
'data2' : np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one -1.390361 -1.397510
1    a  two  2.351051  0.046492
2    b  one  1.713432  0.178670
3    b  two -1.452077 -0.271986
4    a  one  0.451454 -0.100221

In [54]:
df.key2.value_counts()

key2
one    3
two    2
Name: count, dtype: int64

# **Sorting index and values**

In [55]:
df = pd.DataFrame({'A' : [1,2,8,3,5]})
df.index=[100,29,234,1,150]
df

     A
100  1
29   2
234  8
1    3
150  5

In [56]:
df.sort_index(ascending=False) #ordena INDICES

     A
234  8
150  5
100  1
29   2
1    3

In [57]:
df.sort_values('A',ascending=False) #sordena VALORES --> i le pongo false me lo hace de forma descendente

     A
234  8
150  5
1    3
29   2
100  1

# **Ejemplo Practica**

In [ ]:
from google.colab import drive
import os
drive.mount('/content/gdrive')
# Establecer ruta de acceso en drive
import os
print(os.getcwd())
os.chdir("/content/gdrive/My Drive")

Drive already mounted at /content/gdrive; to attempt to forcibly remount, call drive.mount("/content/gdrive", force_remount=True).
/content

In [ ]:
datos=pd.read_csv('datos_empresas.csv')
datos

    Id    Nombre  Ventas
0    1    Quasco    1500
1    2    Tutiro    1300
2    3     Tyuan    1900
3    4   Quantum    1200
4    5  Bertlitz    1400
5    6     Ascor    1700
6    7   Trition    1670
7    8     Teryu    1345
8    9     Oyude    1564
9   10     Yende    1567
10  11    Attron    1346
11  12      Atom    1567
12  13    Quasco    1764
13  14      Tigo    1865
14  15     Claro    1953
15  16  Movistar    1756
16  17    Spirit    1346
17  18        Ut    1654
18  19    Porter    1675
19  20     Tuyer    1457
20  21  Upstream    1324
21  22     It-es    1876
22  23  Daniela     1546
23  24       SAO    1453
24  25     Jumbo    1656
25  26  Olimpica    1456
26  27  Olimpia     1345
27  28    Nartel    1276
28  29      Yuor    1876
29  30    JT-Log    1912

In [ ]:
datos.sort_values(by='Ventas',ascending=False)

    Id    Nombre  Ventas
14  15     Claro    1953
29  30    JT-Log    1912
2    3     Tyuan    1900
28  29      Yuor    1876
21  22     It-es    1876
13  14      Tigo    1865
12  13    Quasco    1764
15  16  Movistar    1756
5    6     Ascor    1700
18  19    Porter    1675
6    7   Trition    1670
24  25     Jumbo    1656
17  18        Ut    1654
11  12      Atom    1567
9   10     Yende    1567
8    9     Oyude    1564
22  23  Daniela     1546
0    1    Quasco    1500
19  20     Tuyer    1457
25  26  Olimpica    1456
23  24       SAO    1453
4    5  Bertlitz    1400
16  17    Spirit    1346
10  11    Attron    1346
7    8     Teryu    1345
26  27  Olimpia     1345
20  21  Upstream    1324
1    2    Tutiro    1300
27  28    Nartel    1276
3    4   Quantum    1200

In [ ]:
datos.drop_duplicates(subset='Nombre')

    Id    Nombre  Ventas
0    1    Quasco    1500
1    2    Tutiro    1300
2    3     Tyuan    1900
3    4   Quantum    1200
4    5  Bertlitz    1400
5    6     Ascor    1700
6    7   Trition    1670
7    8     Teryu    1345
8    9     Oyude    1564
9   10     Yende    1567
10  11    Attron    1346
11  12      Atom    1567
13  14      Tigo    1865
14  15     Claro    1953
15  16  Movistar    1756
16  17    Spirit    1346
17  18        Ut    1654
18  19    Porter    1675
19  20     Tuyer    1457
20  21  Upstream    1324
21  22     It-es    1876
22  23  Daniela     1546
23  24       SAO    1453
24  25     Jumbo    1656
25  26  Olimpica    1456
26  27  Olimpia     1345
27  28    Nartel    1276
28  29      Yuor    1876
29  30    JT-Log    1912